{
  "name": "assessmentbot-langflow-backend",
  "env": {
    "LANGFLOW_PORT": {
      "description": "The internal port that langflow will run from.",
      "value": 7860,
      "required": true
    },
    "LANGFLOW_SUPERUSER": {
      "description": "The superuser user name.",
      "required": true
    },
    "LANGFLOW_SUPERUSER_PASSWORD": {
      "description": "The superuser password. IMPORTANT: Store this value as a secret using Google's Secret Manager.",
      "required": true
    },
    "LANGFLOW_DATABASE_URL": {
      "description": "The URL of your postgres database. IMPORTANT: Store this value as a secret using Google's Secret Manager.",
      "required": true
    },
    "LANGFLOW_DB_CONNECTION_SETTINGS": {
      "description": "The default connection settings. These settings work well with the free Supabase Postgres instance.",
      "required": true,
      "value": { "pool_size": 5, "max_overflow": 10 }
    },

    "GOOGLE_API_KEY": {
      "description": "Your Google Generative AI API Key. Get one from Google AI Studio. IMPORTANT: Store this value as a secret using Google's Secret Manager.",
      "required": true
    },
    "LANGFLOW_SECRET_KEY": {
      "description": "A fernet key used to ensure encryption remains consistent across workers. IMPORTANT: Store this value as a secret using Google's Secret Manager.",
      "required": true
    },
    "LANGFLOW_AUTO_LOGIN": {
      "description": "Defines whether you can access langflow without providing login credentials.",
      "value": false,
      "required": true
    },
    "LANGFLOW_WORKERS": {
      "description": "The number of langflow workers. The more workers, the more requests can be processed in parallel.",
      "value": 4,
      "required": false
    },
    "LANGFLOW_SAVE_DB_IN_CONFIG_DIR": {
      "description": "This setting applies to instances using an SQLite Database rather than postgres. We're not going to use this for the cloud run deployment as it breaks very quickly.",
      "value": false,
      "required": true
    },
    "LANGFLOW_STORE_ENVIRONMENT_VARIABLES": {
      "description": "Defines whether the environment variables get saved to the database. This shouldn't be necessary, but API keys get lost if set to false at the moment.",
      "value": true,
      "required": true
    }
  },
  "options": {
    "allow-unauthenticated": true,
    "memory": "4GB",
    "cpu": "2",
    "port": 7860,
    "http2": true,
    "concurrency": 120,
    "max-instances": 1
  }
}
